{
  "translation": {
    "skills": "Skills",
    "experience": "Experience",
    "education_section": "Education",
    "interests": "Interests",
    "fullstack_developer": "FULLSTACK DEVELOPER",
    "within": "WITHIN",
    "dotnet": ".NET",
    "and": "AND",
    "other_frameworks": "OTHER FRAMEWORKS",
    "contact_me": "Contact Me",
    "my_skills": "My Skills",
    "strong_knowledge": "Strong knowledge in various frameworks and programming languages",
    "programming_journey": "I started my journey in programming by learning the basics of HTML, CSS, and JavaScript on my own...",
    "neoleaf_experience": "At Neoleaf, I had the opportunity to test new working methods and technologies, which provided me with valuable experience. There, I initially worked with Piranha CMS as a headless CMS alongside React. Later, I used Piranha CMS to implement Blazor components directly into the CMS, which was both challenging and educational. During this time, I also learned to work with DevOps, including version control and code deployment via Azure DevOps.",
    "Kunskaper": "I have strong knowledge of JavaScript and experience working with frameworks like React. Currently, I am learning Angular in my free time and look forward to using it in future projects. I have also worked extensively with Docker and SQL Server, and I am comfortable with Git and GitHub.",
    "learning": "I am seeking opportunities where I can continue to grow and contribute to creating innovative and scalable solutions, while further developing my skills.",
    "work_experience": "Work Experience",
    "web_consultant": "WEB CONSULTANT Neoleaf AB, STOCKHOLM",
    "current_job": "November 2023 - Present",
    "web_consultant_description": "I have recently completed the new websites for both Neoleaf and Cobino, where I had the freedom to work quite independently. The only requirement was to use Piranha CMS, but I also chose to integrate Blazor components into the Neoleaf project and created a custom boilerplate. For Cobino, I used Piranha CMS as a headless CMS combined with React for the frontend. I am currently finalizing a new project for Cobino – an AI-powered desktop application developed with Next.js and ChatGPT technology. During my time here, I have also gained valuable experience with Azure, DevOps, and using Docker in real-world projects.",
    "truck_driver": "TRUCK DRIVER, VARIOUS EMPLOYERS, STOCKHOLM/BARCELONA",
    "truck_driver_duration": "January 2006 – May 2023",
    "truck_driver_description": "Crane truck, dump truck, skip loader, hook lift, and compactor. Several years of experience as a truck driver with crane truck, dump truck. Proven ability to deliver safely and on time. Strong work capacity, accuracy, reliability, and independence.",
    "latest_assignments": "My Latest Assignments",
    "Ai cobino": "Cobino application",
    "ai_app_description": "I am currently finalizing an AI-powered desktop application for Cobino, built with Next.js and ChatGPT technology. The goal of the application is to streamline internal processes through intelligent user interactions. This project has deepened my skills in frontend development with Next.js and in integrating AI features into real-world solutions.",
    "cobino": "Cobino",
    "cobino_description": "The Cobino project is now completed. I implemented React together with Piranha CMS in headless mode to build a modern and responsive website. Once the UI/UX design was ready, I was able to move forward quickly with the development. The project included the use of Piranha, React, Docker, a database, and Entity Framework to create a flexible and efficient solution.",
    "neoleaf": "Neoleaf Website Development",
    "neoleaf_description": "I recently rebuilt the Neoleaf website and prepared it for deployment. I worked independently on all development, based on a design template from the UI/UX team. Using Piranha CMS and Blazor components, I created my own boilerplate and utilized HTML, CSS, JavaScript, and C# to make the site both functional and visually appealing. I also integrated Docker for seamless deployment and added interactive animations for an engaging user experience.",
    "linervent": "Linervent",
    "linervent_description": "Together with a colleague, I created the website for Linervent. My role was to develop and design the frontend. I used the client's information to ensure that the design met their needs and expectations. I also edited images to make them look professional and appealing on the website. We used Figma for design and worked with CMS ASP.NET Razor Pages, Vue.js, and Docker for the project.",
    "visit": "Visit Website",
    "education": "Education",
    "journey": "I started my journey in programming by learning the basics of HTML, CSS, and JavaScript on my own...",
    "html": "HTML",
    "css": "CSS",
    "javascript": "JavaScript",
    "self_taught": "driven by curiosity and passion for creation. For several years, I experimented and built websites purely for my own sake, which gave me a solid foundation in web development. It was a time of learning by doing—exploring, testing boundaries, and finding solutions on my own.",
    "college_experience": "When I started studying at university, I had the opportunity to begin working with Neoleaf, marking an important milestone in my development as a developer. Here I could apply my self-taught knowledge in a professional environment while continuing to grow and evolve in the field.",
    "education_description": "I studied web development at EC Utbildning, where I was fortunate to learn from amazing teachers who truly inspired me. It was here that I built the foundation for my knowledge in React, Next.js, Blazor, and ASP.NET Core MVC with Razor Pages. I also gained a deep understanding of database management, including methods like Code-First and Database-First, as well as designing and implementing effective data storage solutions.",
    "csharp": "C#, ASP.NET MVC, Web API",
    "react_next": "React, Next.js, Blazor",
    "typescript_js": "TypeScript, JavaScript, HTML5, CSS",
    "bootstrap_tailwind": "Bootstrap, Tailwind",
    "docker_github_sql": "Docker, GitHub, SQL",
    "education_practical_focus": "The practical focus of the education not only gave me technical skills but also the ability to solve problems and work through the entire development process. I am truly grateful for my time at EC Utbildning, where I learned how to combine technology and creativity to create user-friendly and modern solutions.",
    "interests_main_title": "Leisure and Interests",
    "interest_section1_title": "My interest in programming and new technologies",
    "interest_section1_text": "I have always had a strong interest in programming and in constantly learning new things. For me, programming is not only about solving problems but also about exploring new technologies and frameworks. I already have experience working with JavaScript, React, and Angular, but I always strive to stay updated and explore new tools and frameworks that can help me create even better solutions. Right now, I am especially interested in developing AI applications and building my own CMS with Blazor as a way to challenge myself and deepen my technical knowledge. Building something from scratch is a fantastic way for me to learn new technologies and gain a deeper understanding of system development.",
    "interest_section2_title": "Running – My passion for health and endurance",
    "interest_section2_text": "Running is one of my greatest passions outside of work. I believe it is the perfect combination of physical activity and mental clarity. When I run, I can disconnect from all thoughts and find inner peace, which also helps me maintain focus and energy in both work and daily life. Running gives me the endurance and discipline that I also apply in my projects, both personal and professional. A run in nature is a fantastic activity for both body and mind, and I often find new ideas and solutions while running.",
    "interest_section3_title": "Skiing – My winter favorite",
    "interest_section3_text": "Skiing is another one of my great passions, and I look forward to every winter when I get the chance to hit the slopes. I have been skiing since I was a child, when I lived in Barcelona, and I used to go to Andorra to enjoy the snow. Skiing is an activity that is both challenging and fun, and it gives me a chance to connect with nature. It is not just about speed and technique – it is also about being present in the moment and enjoying every turn down the mountain.",
    "Mobil": "Mobile"
  }
}
