{
        "translation": {
        "skills": "Competencias",
        "experience": "Experiencia",
        "education_section": "Educación",
        "interests": "Intereses",
        "fullstack_developer": "DESARROLLADOR FULLSTACK",
        "within": "EN",
        "dotnet": ".NET",
        "and": "Y",
        "other_frameworks": "OTROS FRAMEWORKS",
        "contact_me": "Contáctame",
        "my_skills": "Mis Competencias",
        "strong_knowledge": "Sólidos conocimientos en varios frameworks y lenguajes de programación",
        "programming_journey": "Comencé mi viaje en la programación aprendiendo por mi cuenta los fundamentos de HTML, CSS y JavaScript...",
        "neoleaf_experience": "En Neoleaf, tuve la oportunidad de probar nuevos métodos de trabajo y tecnologías, lo que me brindó una experiencia valiosa. Allí, trabajé inicialmente con Piranha CMS como un CMS headless junto con React. Más tarde, usé Piranha CMS para implementar componentes de Blazor directamente en el CMS, lo cual fue tanto desafiante como instructivo. Durante este tiempo, también aprendí a trabajar con DevOps, incluyendo el control de versiones y la implementación de código a través de Azure DevOps.",
        "Kunskaper": "Tengo un sólido conocimiento de JavaScript y experiencia trabajando con frameworks como React. Actualmente, estoy aprendiendo Angular en mi tiempo libre y espero poder utilizarlo en proyectos futuros. También he trabajado mucho con Docker y SQL Server, y me siento cómodo usando Git y GitHub.",
        "learning": "Busco oportunidades donde pueda seguir creciendo y contribuir a la creación de soluciones innovadoras y escalables, mientras desarrollo aún más mis habilidades.",
        "work_experience": "Experiencia Laboral",
        "web_consultant": "CONSULTOR WEB Neoleaf AB, ESTOCOLMO",
        "current_job": "Noviembre 2023 - Actualidad",
        "web_consultant_description": "Acabo de terminar la nueva página web de Neoleaf, donde tuve la libertad de trabajar bastante de manera independiente. El único requisito era utilizar Piranha CMS, pero también elegí trabajar con componentes Blazor en Piranha CMS. De esta manera, creé mi propia plantilla base para el proyecto (casi listo, solo quedan algunos detalles antes de desplegar la web). Después, abordaré la web de Cobino. El plan es usar Piranha CMS como headless CMS y construir el frontend con React. Durante mi tiempo aquí, también he aprendido mucho sobre Azure, DevOps y cómo usar Docker en proyectos.",
        "truck_driver": "CONDUCTOR DE CAMIONES, VARIOS EMPLEADORES, ESTOCOLMO/BARCELONA",
        "truck_driver_duration": "Enero 2006 – Mayo 2023",
        "truck_driver_description": "Camión grúa, camión volquete, camión con sistema de cadenas, portacontenedores y compactador. Varios años de experiencia como conductor de camiones con grúa, volquete. Capacidad comprobada para entregar de manera segura y a tiempo. Gran capacidad de trabajo, precisión, fiabilidad e independencia.",
        "latest_assignments": "Mis Últimos Proyectos",
        "cobino": "Cobino",
        "cobino_description": "Pronto comenzaremos a trabajar en Cobino, y ya he empezado a implementar React con Piranha CMS en modo headless. Actualmente, estoy esperando el diseño UI/UX para poder continuar lo antes posible. En este proyecto utilizaremos Piranha, React, Docker, una base de datos y Entity Framework para construir una solución flexible y eficiente.",
        "neoleaf": "Desarrollo del sitio web de Neoleaf",
        "neoleaf_description": "Recientemente reconstruí el sitio web de Neoleaf y lo preparé para su despliegue. Trabajé de manera independiente en todo el desarrollo, basándome en una plantilla de diseño del equipo de UI/UX. Usando Piranha CMS y componentes Blazor, creé mi propio boilerplate y utilicé HTML, CSS, JavaScript y C# para hacer que el sitio fuera funcional y visualmente atractivo. También integré Docker para un despliegue sin problemas y añadí animaciones interactivas para una experiencia de usuario atractiva.",
        "linervent": "Linervent",
        "linervent_description": "Junto con un colega, creé el sitio web para Linervent. Mi función fue desarrollar y diseñar el frontend. Utilicé la información del cliente para asegurarme de que el diseño cumpliera con sus necesidades y expectativas. También edité imágenes para que se vieran profesionales y atractivas en el sitio web. Trabajamos con Figma para el diseño y utilizamos CMS ASP.NET Razor Pages, Vue.js y Docker para el proyecto.",
        "visit": "Visitar Sitio Web",
        "education": "Educación",
        "journey": "Comencé mi viaje en la programación aprendiendo por mi cuenta los fundamentos de HTML, CSS y JavaScript...",
        "html": "HTML",
        "css": "CSS",
        "javascript": "JavaScript",
        "self_taught": "impulsado por la curiosidad y la pasión por crear. Durante varios años, experimenté y construí sitios web solo para mí mismo, lo que me dio una base sólida en desarrollo web. Fue un tiempo de aprendizaje a través de la práctica, explorando, probando límites y encontrando soluciones por mi cuenta.",
        "college_experience": "Cuando comencé a estudiar en la universidad, tuve la oportunidad de comenzar a trabajar con Neoleaf, lo que marcó un hito importante en mi desarrollo como desarrollador. Aquí pude aplicar mis conocimientos autodidactas en un entorno profesional, mientras seguía creciendo y evolucionando en el campo.",
        "education_description": "Estudié desarrollo web en EC Utbildning, donde tuve la suerte de aprender de increíbles maestros que realmente me inspiraron. Fue aquí donde construí la base de mis conocimientos en React, Next.js, Blazor y ASP.NET Core MVC con Razor Pages. También adquirí una profunda comprensión de la gestión de bases de datos, incluidos métodos como Code-First y Database-First, así como diseñar e implementar soluciones efectivas de almacenamiento de datos.",
        "csharp": "C#, ASP.NET MVC, Web API",
        "react_next": "React, Next.js, Blazor",
        "typescript_js": "TypeScript, JavaScript, HTML5, CSS",
        "bootstrap_tailwind": "Bootstrap, Tailwind",
        "docker_github_sql": "Docker, GitHub, SQL",
        "education_practical_focus": "El enfoque práctico de la educación no solo me dio habilidades técnicas, sino también la capacidad de resolver problemas y trabajar en todo el proceso de desarrollo. Estoy realmente agradecido por mi tiempo en EC Utbildning, donde aprendí a combinar tecnología y creatividad para crear soluciones fáciles de usar y modernas.",
        "interests_main_title": "Ocio e Intereses",
        "interest_section1_title": "Mi interés por la programación y las nuevas tecnologías",
        "interest_section1_text": "Siempre he tenido un fuerte interés por la programación y por aprender cosas nuevas constantemente. Para mí, la programación no solo se trata de resolver problemas, sino también de explorar nuevas tecnologías y frameworks. Ya tengo experiencia trabajando con JavaScript, React y Angular, pero siempre me esfuerzo por mantenerme actualizado y explorar nuevas herramientas y frameworks que me ayuden a crear soluciones aún mejores. En este momento, me interesa especialmente desarrollar aplicaciones de inteligencia artificial y construir mi propio CMS con Blazor, como una forma de desafiarme a mí mismo y profundizar mis conocimientos técnicos. Construir algo desde cero es una manera fantástica de aprender nuevas tecnologías y obtener una comprensión más profunda del desarrollo de sistemas.",
        "interest_section2_title": "Correr – Mi pasión por la salud y la resistencia",
        "interest_section2_text": "Correr es una de mis mayores pasiones fuera del trabajo. Creo que es la combinación perfecta de actividad física y claridad mental. Cuando corro, puedo desconectarme de todos los pensamientos y encontrar una paz interior, lo cual también me ayuda a mantener el enfoque y la energía tanto en el trabajo como en la vida diaria. Correr me brinda la resistencia y la disciplina que también aplico en mis proyectos, tanto personales como profesionales. Una carrera en la naturaleza es una actividad fantástica para el cuerpo y la mente, y a menudo encuentro nuevas ideas y soluciones mientras corro.",
        "interest_section3_title": "Esquí – Mi favorito invernal",
        "interest_section3_text": "El esquí es otra de mis grandes pasiones, y espero con ansias cada invierno, cuando tengo la oportunidad de salir a las pistas. Esquío desde que era pequeño, cuando vivía en Barcelona y solía ir a Andorra para disfrutar de la nieve. El esquí es una actividad que es tan desafiante como divertida, y me da la oportunidad de conectar con la naturaleza. No se trata solo de velocidad y técnica, sino también de estar presente en el momento y disfrutar cada curva al bajar la montaña.",
        "Mobil": "Móvil"
      }
    }



