{
  "translation": {
    "skills": "Kompetenser",
    "experience": "Erfarenhet",
    "education_section": "Utbildning",
    "interests": "Intressen",
    "fullstack_developer": "FULLSTACK-UTVECKLARE",
    "within": "INOM",
    "dotnet": ".NET",
    "and": "OCH",
    "other_frameworks": "ANDRA RAMVERK",
    "contact_me": "Kontakta mig",
    "my_skills": "Mina Kompetenser",
    "strong_knowledge": "Starka kunskaper inom olika ramverk såsom programmeringsspråk",
    "journey": "Jag började min resa inom programmering på egen hand genom att lära mig grunderna i HTML, CSS och JavaScript. Det väckte verkligen mitt intresse och fick mig att fundera på att byta karriär. För att ta nästa steg började jag studera till webbutvecklare inom .NET på EC Utbildning med målet att bli en fullstack-utvecklare.",
    "neoleaf_experience": "På Neoleaf fick jag möjligheten att testa nya arbetssätt och teknologier, vilket gav mig värdefull erfarenhet. Där arbetade jag först med Piranha CMS som headless tillsammans med React. Senare använde jag Piranha CMS för att implementera Blazor-komponenter direkt i CMS:et, vilket var både utmanande och lärorikt. Under den här tiden lärde jag mig också att arbeta med DevOps, inklusive versionshantering och koddistribution via Azure DevOps.",
    "Kunskaper": "Jag har starka kunskaper i JavaScript och erfarenhet av att arbeta med ramverk som React. Just nu lär jag mig Angular på min fritid och ser fram emot att använda det i framtida projekt. Jag har även arbetat mycket med Docker och SQL Server samt är bekväm med Git och GitHub.",
    "learning": "Jag söker möjligheter där jag kan fortsätta växa och bidra till att skapa innovativa och skalbara lösningar, samtidigt som jag utvecklar mina färdigheter ytterligare.",
    "work_experience": "Yrkeserfarenhet",
    "web_consultant": "WEBBKONSULT Neoleaf AB, STOCKHOLM",
    "current_job": "november 2023 - nuvarande",
    "web_consultant_description": "Just nu är jag klar med både Neoleafs och Cobinos nya webbplatser, där jag hade friheten att arbeta ganska självständigt. Det enda kravet var att använda Piranha CMS, men jag valde även att integrera Blazor-komponenter i Neoleaf-projektet och skapade ett eget boilerplate. För Cobino använde jag Piranha CMS som headless CMS tillsammans med React i frontend. Just nu håller jag på att slutföra ett nytt projekt för Cobino – en AI-driven desktopapplikation byggd med Next.js och ChatGPT-teknik. Under min tid här har jag dessutom lärt mig mycket om Azure, DevOps och hur man använder Docker i praktiska projekt.",
    "truck_driver": "LASTBILSFÖRARE, FLERA ARBETSGIVARE, STOCKHOLM/BARCELONA",
    "truck_driver_duration": "januari 2006 – maj 2023",
    "truck_driver_description": "Kranbil, schaktbil, liftdumper, lastväxlare och komprimator. Flerårig erfarenhet som lastbilschaufför med kranbil och schaktbil. Bevisad förmåga att leverera säkert och i tid. Stark arbetskapacitet, noggrannhet, pålitlighet och självständighet.",
    "latest_assignments": "Mina senaste uppdrag",
    "Ai cobino": "Cobino applikation",
    "ai_app_description": "Just nu håller jag på att färdigställa en AI-driven desktopapplikation för Cobino, byggd med Next.js och ChatGPT-teknik. Syftet med applikationen är att effektivisera interna processer genom intelligenta användarinteraktioner. Projektet har gett mig djupare insikter i både frontendutveckling med Next.js och hur man integrerar AI-funktioner i praktiska lösningar.",
    "cobino": "Cobino",
    "cobino_description": "Projektet för Cobino är nu färdigställt. Jag implementerade React tillsammans med Piranha CMS i headless-läge för att bygga en modern och responsiv webbplats.När UI/UX-designen var klar kunde jag snabbt gå vidare med utvecklingen. I projektet använde vi Piranha, React, Docker, en databas och Entity Framework för att skapa en flexibel och effektiv lösning.",
    "neoleaf": "Utvecklare av Neoleaf-sidan",
    "neoleaf_description": "Jag har nyligen byggt om Neoleaf-sidan och förbereder den för deployment. Jag arbetade självständigt med all utveckling baserat på en designmall från UI/UX-teamet. Med Piranha CMS och Blazor-komponenter skapade jag ett eget boilerplate och använde HTML, CSS, JavaScript och C# för att göra sidan både funktionell och visuellt tilltalande. Jag integrerade även Docker för smidig deployment och lade till interaktiva animationer för en engagerande användarupplevelse.",
    "linervent": "Linervent",
    "linervent_description": "Tillsammans med en kollega skapade jag webbplatsen för Linervent. Min roll var att utveckla och designa frontend-sidan. Jag använde kundens information för att säkerställa att designen mötte deras behov och förväntningar. Jag redigerade också bilder för att de skulle se professionella och tilltalande ut på webbplatsen. Vi arbetade med Figma för designen och använde CMS ASP.NET Razor Pages, Vue.js och Docker för projektet.",
    "visit": "Besök webbplatsen",
    "education": "Utbildning",
    "programming_journey": "Jag började min resa inom programmering på egen hand genom att lära mig grunderna i HTML, CSS och JavaScript.",
    "html": "HTML",
    "css": "CSS",
    "javascript": "JavaScript",
    "self_taught": "driven av min nyfikenhet och passion för att skapa. Under flera år experimenterade jag och byggde webbsidor enbart för min egen skull, vilket gav mig en solid grund i webbutveckling. Det var en tid av lärande genom att göra – att utforska, testa gränser och hitta lösningar på egen hand.",
    "college_experience": "När jag började studera vid högskolan fick jag möjligheten att börja arbeta med Neoleaf, vilket markerade en viktig milstolpe i min utveckling som utvecklare. Här kunde jag använda mina autodidaktiska kunskaper i en professionell miljö och samtidigt fortsätta växa och utvecklas inom området.",
    "education_description": "Jag har studerat webbutveckling på EC Utbildning, där jag hade turen att få lära mig av fantastiska lärare som verkligen inspirerade mig. Det var här jag byggde grunden för mina kunskaper inom React, Next.js, Blazor och ASP.NET Core MVC med Razor Pages. Jag fick också en djup förståelse för databashantering, inklusive metoder som Code-First och Database-First, samt att designa och implementera effektiva datalagringslösningar.",
    "csharp": "C#, ASP.NET MVC, Web API",
    "react_next": "React, Next.js, Blazor",
    "typescript_js": "TypeScript, JavaScript, HTML5, CSS",
    "bootstrap_tailwind": "Bootstrap, Tailwind",
    "docker_github_sql": "Docker, GitHub, SQL",
    "education_practical_focus": "Den praktiska inriktningen på utbildningen gav mig inte bara tekniska färdigheter utan också förmågan att lösa problem och arbeta med hela utvecklingsprocessen. Jag är verkligen tacksam för min tid på EC Utbildning, där jag lärde mig att kombinera teknik och kreativitet för att skapa användarvänliga och moderna lösningar.",
    "interests_main_title": "Fritid och Intressen",
    "interest_section1_title": "Mitt intresse för programmering och nya teknologier",
    "interest_section1_text": "Jag har alltid haft ett starkt intresse för programmering och att ständigt lära mig nya saker. För mig handlar programmering inte bara om att lösa problem, utan också om att utforska nya teknologier och ramverk. Jag har redan erfarenhet av att arbeta med JavaScript, React och Angular, men jag strävar alltid efter att hålla mig uppdaterad och utforska nya verktyg och ramverk som kan hjälpa mig att skapa ännu bättre lösningar. Just nu är jag särskilt intresserad av att utveckla AI-applikationer och att bygga mitt eget CMS med Blazor, som ett sätt att både utmana mig själv och fördjupa mina tekniska kunskaper. Att bygga något från grunden är ett fantastiskt sätt för mig att lära mig nya teknologier och få en djupare förståelse för systemutveckling.",
    "interest_section2_title": "Löpning – Min passion för hälsa och uthållighet",
    "interest_section2_text": "Löpning är en av mina största passioner utanför arbetet. Jag tycker att det är den perfekta kombinationen av fysisk aktivitet och mental klarhet. När jag springer kan jag koppla bort alla tankar och hitta ett inre lugn, vilket också hjälper mig att hålla fokus och energi i både jobbet och vardagen. Löpning ger mig den uthålligheten och disciplinen som jag också tillämpar i mina projekt, både personliga och professionella. En löptur i naturen är en fantastisk aktivitet för både kropp och själ, och jag hittar ofta nya idéer och lösningar medan jag springer.",
    "interest_section3_title": "Skidåkning – Min vinterfavorit",
    "interest_section3_text": "Skidåkning är en annan av mina stora passioner, och jag ser fram emot varje vinter när jag får möjligheten att ge mig ut i backarna. Jag har åkt skidor sedan jag var liten, när jag bodde i Barcelona, och jag brukade åka till Andorra för att njuta av snön. Skidåkning är en aktivitet som både är utmanande och rolig, och som ger mig en chans att komma nära naturen. Det handlar inte bara om fart och teknik – det handlar också om att vara närvarande i ögonblicket och njuta av varje sväng nedför berget.",
    "Mobil": "Mobil"
  }

}